exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/esb_createTriggeredSendDefinition_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.exacttarget"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header></soapenv:Header>
   <soapenv:Body>
      <urn:accessToken>%s(accessToken)</urn:accessToken>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:createOptions>
         <Options>
            <CallsInConversation>1</CallsInConversation>
            <ConversationID>%s(esbCreateTriggeredSendDefinitionOpt)</ConversationID>
            <RequestType>Asynchronous</RequestType>
            <SequenceCode>1</SequenceCode>
         </Options>
      </urn:createOptions>
      <urn:triggeredSendDefinitionObjects>
         <Objects xsi:type="TriggeredSendDefinition">
            <CustomerKey>%s(esbCreateTriggeredSendDefinitionOpt)</CustomerKey>
            <Name>%s(esbCreateTriggeredSendDefinitionOpt)</Name>
            <Description>OptTriggeredSendDefinitionDescription</Description>
            <SendClassification>
               <CustomerKey>testSendClassification</CustomerKey>
               <ObjectID xsi:nil="true" />
            </SendClassification>
            <Email>
               <CustomerKey>EmailCustomerKey</CustomerKey>
               <ID>%s(emailId)</ID>
            </Email>
            <TriggeredSendStatus>Active</TriggeredSendStatus>
         </Objects>
      </urn:triggeredSendDefinitionObjects>
      <urn:method>createTriggeredSendDefinition</urn:method>
   </soapenv:Body>
</soapenv:Envelope>